/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   close.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: zytrams <zytrams@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/19 20:20:03 by zytrams           #+#    #+#             */
/*   Updated: 2019/10/20 19:36:57 by zytrams          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <engine.h>

void		close_game(int error)
{
	// РАСКОМЕНТИТЬ, КОГДА ВСЕ ГОТОВО ИЛИ ПОТЕСТИТЬ
	// engine_remove_resources_folder(MODE_SILENT);
	exit(error);
}
